=====
sharp
=====

x#y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==============
sharp-question
==============

x#?y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=======
percent
=======

x%y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=========
ampersand
=========

x&y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

====
star
====

x*y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=========
star-star
=========

x**y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

====
plus
====

x+y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=========
plus-plus
=========

x++y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====
comma
=====

x,y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====
minus
=====

x-y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===
dot
===

x.y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====
dot-dot
=====

x..y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

============
dot-question
============

x.?y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====
slash
=====

x/y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===========
slash-slash
===========

x//y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=========
less-less
=========

x<<y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====
at-at
=====

x@@y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==============
at-at-question
==============

x@@?y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====
power
=====

x^y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===============
power-star-star
===============

x^**y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==========
power-less
==========

x^<y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

================
power-less-equal
================

x^<=y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=============
power-greater
=============

x^>y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===================
power-greater-equal
===================

x^>=y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===========
power-power
===========

x^^y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==========
underscore
==========

x_y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===============
underscore-less
===============

x_<y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=====================
underscore-less-equal
=====================

x_<=y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==================
underscore-greater
==================

x_>y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

========================
underscore-greater-equal
========================

x_>=y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===
bar
===

x|y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==============
bar-underscore
==============

x#y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

=======
bar-bar
=======

x||y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

====
cdot
====

x·y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===========
box-product
===========

x⊠y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

===============
shuffle-product
===============

x⧢y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_left
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))

==========
not-equals
==========

x!=y

---

(source_file
  (statement
    (parse_tree
      (binary
        (binary_right
          (parse_tree
            (token
              (identifier)))
          (parse_tree
            (token
              (identifier))))))))
