=================
empty parentheses
=================

()

---

(source_file
  (statement
    (parse_tree
      (empty_parentheses))))

==============
empty brackets
==============

[]

---

(source_file
  (statement
    (parse_tree
      (empty_parentheses))))

============
empty braces
============

{}

---

(source_file
  (statement
    (parse_tree
      (empty_parentheses))))

=====================
empty angled brackets
=====================

<||>

---

(source_file
  (statement
    (parse_tree
      (empty_parentheses))))

===========
parentheses
===========

(x)

---

(source_file
  (statement
    (parse_tree
      (parentheses
        (parse_tree
          (token
            (identifier)))))))

========
brackets
========

[x]

---

(source_file
  (statement
    (parse_tree
      (parentheses
        (parse_tree
          (token
            (identifier)))))))

======
braces
======

{x}

---

(source_file
  (statement
    (parse_tree
      (parentheses
        (parse_tree
          (token
            (identifier)))))))

===============
angled brackets
===============

<|x|>

---

(source_file
  (statement
    (parse_tree
      (parentheses
        (parse_tree
          (token
            (identifier)))))))
