======
symbol
======

symbol x

---

(source_file
  (statement
    (parse_tree
      (quote
        (identifier)))))

======
global
======

global x

---

(source_file
  (statement
    (parse_tree
      (global_quote
        (identifier)))))

=====
local
=====

local x

---

(source_file
  (statement
    (parse_tree
      (local_quote
        (identifier)))))

===========
threadLocal
===========

threadLocal x

---

(source_file
  (statement
    (parse_tree
      (thread_quote
        (identifier)))))

==============
threadVariable
==============

threadVariable x

---

(source_file
  (statement
    (parse_tree
      (thread_quote
        (identifier)))))
